In [55]:
#decision tree: in this we need to select on the tree data model
# we need to select the model on the basis of less entropy
#less entropy= where the data has the almost similar data----it is HIGH INFORMATION GAIN
#high entropy= where the data has the most different data----it is LOW INFORMATION  GAIN

In [56]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [57]:
df=pd.read_csv(r'E:\py\py-master\ML\9_decision_tree\salaries.csv')

In [58]:
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [59]:
inputs=df.drop('salary_more_then_100k',axis='columns')

In [60]:
target=df.salary_more_then_100k

In [61]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [62]:
input

       company                  job     degree  company_n  job_n  degree_n
0       google      sales executive  bachelors          2      2         0
1       google      sales executive    masters          2      2         1
2       google     business manager  bachelors          2      0         0
3       google     business manager    masters          2      0         1
4       google  computer programmer  bachelors          2      1         0
5       google  computer programmer    masters          2      1         1
6   abc pharma      sales executive    masters          0      2         1
7   abc pharma  computer programmer  bachelors          0      1         0
8   abc pharma     business manager  bachelors          0      0         0
9   abc pharma     business manager    masters          0      0         1
10    facebook      sales executive  bachelors          1      2         0
11    facebook      sales executive    masters          1      2         1
12    facebook     business manager  bachelors          1      0         0
13    facebook     business manager    masters          1      0         1
14    facebook  computer programmer  bachelors          1      1         0
15    facebook  computer programmer    masters          1      1         1

In [63]:
from sklearn.preprocessing import LabelEncoder
#we need to convert the string values to numeric value.

In [64]:
#we need to create 3 objects becoz of 3 columns we need to change.
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()

In [65]:
#we need to crtaete 3 new columns using fit_transform method.
input['company_n']=le_company.fit_transform(inputs['company'])
input['job_n']=le_job.fit_transform(inputs['job'])
input['degree_n']=le_degree.fit_transform(inputs['degree'])

In [66]:
input.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [67]:
inputs_n=input.drop(['company','job','degree'],axis='columns')

In [68]:
inputs_n.head()

   company_n  job_n  degree_n
0          2      2         0
1          2      2         1
2          2      0         0
3          2      0         1
4          2      1         0

In [69]:
from sklearn import tree

In [70]:
model=tree.DecisionTreeClassifier()

In [71]:
model.fit(inputs_n,target)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [72]:
model.score(inputs_n,target)

1.0

In [73]:
model.predict([[2,2,1]])

array([0], dtype=int64)

In [74]:
#in decision tree model for input values,we are giving them dummies so that we can make decision.
#in the Logistic classification we are giving targets dummies.

In [75]:
#ASSIGNMENT

In [76]:
df=pd.read_csv(r'E:\py\py-master\ML\9_decision_tree\Exercise\titanic.csv')

In [77]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [78]:
df=df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')

In [79]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [80]:
from sklearn.preprocessing import LabelEncoder
#we can also use get_dummies of the pandas

In [81]:
l_Sex_n=LabelEncoder()

In [82]:
df['sex_n']=l_Sex_n.fit_transform(df['Sex'])

In [83]:
df.head()

   Survived  Pclass     Sex   Age     Fare  sex_n
0         0       3    male  22.0   7.2500      1
1         1       1  female  38.0  71.2833      0
2         1       3  female  26.0   7.9250      0
3         1       1  female  35.0  53.1000      0
4         0       3    male  35.0   8.0500      1

In [84]:
df.drop(['Sex'],axis='columns')

     Survived  Pclass   Age     Fare  sex_n
0           0       3  22.0   7.2500      1
1           1       1  38.0  71.2833      0
2           1       3  26.0   7.9250      0
3           1       1  35.0  53.1000      0
4           0       3  35.0   8.0500      1
..        ...     ...   ...      ...    ...
886         0       2  27.0  13.0000      1
887         1       1  19.0  30.0000      0
888         0       3   NaN  23.4500      0
889         1       1  26.0  30.0000      1
890         0       3  32.0   7.7500      1

[891 rows x 5 columns]

In [124]:
from sklearn import tree

In [125]:
mod=tree.DecisionTreeClassifier()

In [126]:
inputs=df.drop(['Survived','Sex'],axis='columns')

In [127]:
inputs.head()

   Pclass   Age     Fare  sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [128]:
pd.isna(inputs).sum()

Pclass      0
Age       177
Fare        0
sex_n       0
dtype: int64

In [129]:
target=df.Survived

In [130]:
inputs['Age'].fillna(inputs['Age'].mean(),inplace=True)

In [131]:
inputs

     Pclass        Age     Fare  sex_n
0         3  22.000000   7.2500      1
1         1  38.000000  71.2833      0
2         3  26.000000   7.9250      0
3         1  35.000000  53.1000      0
4         3  35.000000   8.0500      1
..      ...        ...      ...    ...
886       2  27.000000  13.0000      1
887       1  19.000000  30.0000      0
888       3  29.699118  23.4500      0
889       1  26.000000  30.0000      1
890       3  32.000000   7.7500      1

[891 rows x 4 columns]

In [132]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [133]:
mod.fit(inputs,target)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [134]:
mod.score(inputs,target)

0.9797979797979798

In [138]:
inputs.head()

   Pclass   Age     Fare  sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [147]:
mod.predict([[1,80,50,1]])

array([1], dtype=int64)